ranma/ESP8266_NONOS_SDK/third_party/relib/main/user_start.c
	return 0;
}

#if 1
void ICACHE_FLASH_ATTR
relib_user_local_init(void)
{
	uint8_t bVar1;
	char cVar2;
	bool bVar3;
	uint8_t uVar4;
	int iVar5;
	void *pv;
	uint32_t uVar6;
	phy_init_and_rf_cal_st *phy_rf_data;
	char *rf_cal_data;
	char cVar8;
	char cVar9;

	_xtos_set_exception_handler(9,user_fatal_exception_handler);
	_xtos_set_exception_handler(0,user_fatal_exception_handler);
	_xtos_set_exception_handler(2,user_fatal_exception_handler);
	_xtos_set_exception_handler(3,load_non_32_wide_handler);
	_xtos_set_exception_handler(0x1c,user_fatal_exception_handler);
	_xtos_set_exception_handler(0x1d,user_fatal_exception_handler);
	_xtos_set_exception_handler(8,user_fatal_exception_handler);
	DPRINTF("sleep_reset_analog_rtcreg_8266\n");
	sleep_reset_analog_rtcreg_8266();  /* resets clocks, so re-init uart after */
	relib_reset_uart_baud(BOOT_CLK_FREQ);
	user_pre_init();
	iVar5 = read_macaddr_from_otp(info.sta_mac);
	if (iVar5 == 0) {
		iVar5 = memcmp(info.sta_mac,g_ic.ic_profile.mac_bakup,6);
		if (iVar5 != 0) {
			memcpy(g_ic.ic_profile.mac_bakup,info.sta_mac,6);
			os_printf_plus("Backup\n");
			system_save_sys_param();
		}
	}
	else {
		bVar1 = g_ic.ic_profile.mac_bakup[0] & 1;
		if ((g_ic.ic_profile.mac_bakup[0] & 1) == 0) {
			iVar5 = memcmp(info.sta_mac,g_ic.ic_profile.mac_bakup,6);
			if (iVar5 == 0) {
				os_printf_plus("Ce\n");
			}
			else if (bVar1 == 0) {
				memcpy(info.sta_mac,g_ic.ic_profile.mac_bakup,6);
				os_printf_plus("Load\n");
			}
		}
		else {
			if (iVar5 == -1) {
				info.sta_mac[0] = '\\';
				info.sta_mac[1] = 0xcf;
				info.sta_mac[2] = '\x7f';
			}
			memcpy(g_ic.ic_profile.mac_bakup,info.sta_mac,6);
			os_printf_plus("Backup default %d\n",iVar5);
			system_save_sys_param();
		}
	}
	wifi_set_backup_mac(info.sta_mac);
	wifi_softap_cacl_mac(info.softap_mac, info.sta_mac);
	info.softap_info.ip.addr = 0x104a8c0; /* 192.168.4.1 */
	info.softap_info.gw.addr = 0x104a8c0;
	info.softap_info.netmask.addr = 0xffffff;
	DPRINTF("ets_timer_init\n");
	ets_timer_init();
	DPRINTF("lwip_init\n");
	lwip_init();
	espconn_init();
	lwip_timer_interval = 25; /* 25ms */
	ets_timer_setfn(&check_timeouts_timer,sys_check_timeouts,0);
	DPRINTF("user_init_default_profile\n");
	user_init_default_profile();
	if ((DPORT->PERI_IO_SWAP & 1) == 0) {
		system_uart_de_swap();
	} else {
		system_uart_swap();
	}
	uVar6 = RTC->STORE[0];
	while ((UART0->STATUS & 0xff0000) != 0);
	while ((UART1->STATUS & 0xff0000) != 0);
	IOMUX->GPIO0 &= 0xfffffeff;  /* Switch from CLK_OUT to GPIO */
	IOMUX->GPIO2 &= 0xfffffeff;  /* Switch from U0TXD_BK to GPIO */
	system_rtc_mem_read(0,&rst_if,0x1c);
	if (uVar6 == 0) {
		uVar6 = rtc_get_reset_reason();
		if (uVar6 == 1) {
			memset(&rst_if,0,0x1c);
		}
		else {
			uVar6 = rtc_get_reset_reason();
			if (uVar6 == 2) {
				if (((rst_if.flag != 5) || (rst_if.epc1 != 0)) || (rst_if.excvaddr != 0)) {
					memset(&rst_if,0,0x1c);
					rst_if.flag = 6;
				}
			}
			else {
				rtc_get_reset_reason();
			}
		}
	}
	else if (6 < uVar6) {
		memset(&rst_if,0,0x1c);
	}
	system_rtc_mem_write(0,&rst_if,0x1c);
	DPRINTF("read phy and rf cal data\n");
	phy_rf_data = os_zalloc_dram(sizeof(*phy_rf_data));
	spi_flash_read(flashchip->sector_size * system_phy_init_sector,(void*)phy_rf_data,0x80);
	rf_cal_data = (void*)&phy_rf_data->rf_cal;
	spi_flash_read(flashchip->sector_size * system_rf_cal_sector,(void*)rf_cal_data,0x274);
	phy_rx_gain_dc_table = phy_rf_data->rf_cal.rx_gain_dc_table;
	iVar5 = flash_data_check(rf_cal_data);
	if ((iVar5 == 0) && (iVar5 = phy_check_data_table(phy_rx_gain_dc_table,0x7d,1), iVar5 == 0)) {
		bVar3 = false;
	}
	else {
		bVar3 = true;
	}
	if (rst_if.flag != 5) {
		phy_afterwake_set_rfoption(1);
	}
	if ((rst_if.flag != 5) && (!bVar3)) {
		write_data_to_rtc(rf_cal_data);
	}
	if (phy_rf_data->phy_init.param_ver_id == '\x05') {
		cVar9 = '\v';
		cVar2 = phy_rf_data->pad1[0x71];
		if (freq_trace_enable == false) {
			uVar6 = phy_rf_data->pad1[0x70];
			if (((uVar6 < 2) && (-1 < (int)uVar6)) || (uVar6 == 3)) {
LAB_4022f98c:
				phy_rf_data->pad1[0x70] = '\0';
			}
			else {
				cVar9 = '\a';
				if (uVar6 == 5) {
					if (-1 < cVar2) {
						if (cVar2 < '\a') {
							cVar9 = '\0';
							phy_rf_data->pad1[0x71] = '\0';
						}
						else {
							cVar9 = '\x05';
						}
					}
				}
				else if (uVar6 == 7) {
					if (-1 < cVar2) {
						cVar9 = '\0';
						phy_rf_data->pad1[0x71] = '\0';
					}
				}
				else if (uVar6 == 9) {
					if (-1 < cVar2) {
						if (cVar2 < '\a') {
							cVar9 = '\0';
							phy_rf_data->pad1[0x71] = '\0';
						}
						else {
							cVar9 = '\x05';
						}
					}
				}
				else {
					if (uVar6 != 0xb) goto LAB_4022f98c;
					if (-1 < cVar2) {
						cVar9 = '\0';
						phy_rf_data->pad1[0x71] = '\0';
					}
				}
				phy_rf_data->pad1[0x70] = cVar9;
			}
		}
		else if (freq_trace_enable == true) {
			bVar1 = phy_rf_data->pad1[0x70];
			cVar8 = '\x03';
			if ((1 < bVar1) && (bVar1 != 3)) {
				if (bVar1 == 5) {
					cVar8 = cVar9;
					if ((-1 < cVar2) && (cVar8 = '\t', cVar2 < '\a')) {
						phy_rf_data->pad1[0x71] = '\0';
						cVar8 = '\x03';
					}
				}
				else if (bVar1 == 7) {
					cVar8 = cVar9;
					if (-1 < cVar2) {
						phy_rf_data->pad1[0x71] = '\0';
						cVar8 = '\x03';
					}
				}
				else if (bVar1 == 9) {
					cVar8 = cVar9;
					if (-1 < cVar2) {
						if (cVar2 < '\a') {
							phy_rf_data->pad1[0x71] = '\0';
							cVar8 = '\x03';
						}
						else {
							cVar8 = '\t';
						}
					}
				}
				else if ((bVar1 == 0xb) && (cVar8 = cVar9, -1 < cVar2)) {
					phy_rf_data->pad1[0x71] = '\0';
					cVar8 = '\x03';
				}
			}
			phy_rf_data->pad1[0x70] = cVar8;
		}
		DPRINTF("chip_init\n");
		chip_init(phy_rf_data, info.sta_mac);  /* resets clocks, so re-init uart */
		relib_reset_uart_baud(NORMAL_CLK_FREQ);
	}
	else {
		os_printf_plus("rf_cal[0] !=0x05,is 0x%02X\n");
		ets_delay_us(10000);
		system_restart_local();
	}
	g_ic.phy_function = (phy_rf_data->pad1[0x70] & 5U) == 1;
	os_printf_plus("rf cal sector: %d\n",system_rf_cal_sector);
	os_printf_plus("freq trace enable %d\n",freq_trace_enable);
	os_printf_plus("rf[112] : %02x\n", phy_rf_data->pad1[0x70]);
	os_printf_plus("rf[113] : %02x\n", phy_rf_data->pad1[0x71]);
	os_printf_plus("rf[114] : %02x\n", phy_rf_data->pad1[0x72]);
	if ((bVar3) &&
		 (((rst_if.flag != 5 && (uVar6 = rtc_get_reset_reason(), uVar6 == 2)) ||
			(uVar6 = rtc_get_reset_reason(), uVar6 == 1)))) {
		os_printf_plus("w_flash\n");
		get_data_from_rtc(rf_cal_data);
		wifi_param_save_protect_with_check(
			system_rf_cal_sector,
			flashchip->sector_size,
			rf_cal_data,
			0x274);
	}
	vPortFree(phy_rf_data,"app_main.c",0x53b);
	os_printf_plus("\nSDK ver: %s compiled @ Oct	9 2021 09:52:05\n",
		"3.0.5(b29dcd3)");
	uint32_t phy_ver = RTCMEM->BACKUP[0x7c/4];
	uint32_t pp_ver = RTCMEM->SYSTEM[0xf8/4];
	os_printf_plus("phy ver: %d_%d, pp ver: %d.%d\n\n",
		(phy_ver >> 0x10) & 0xfff, phy_ver >> 0x1c,
		(pp_ver & 0xff00) >> 8, pp_ver & 0xff);
	if ((g_ic.phy_function & 1) != 0) {
		uint32_t freq_cal = RTCMEM->BACKUP[0x78/4];
		if (rst_if.flag == 5) {
			TestStaFreqCalValInput = freq_cal >> 0x10;
			chip_v6_set_chan_offset(1, TestStaFreqCalValInput);
			TestStaFreqCalValDev = TestStaFreqCalValInput;
		}
		else {
			TestStaFreqCalValInput = 0;
			RTCMEM->BACKUP[0x78/4] = freq_cal & 0xffff;
		}
	}
	system_rtc_mem_write(0,pv,0x1c);
	vPortFree(pv,"app_main.c",0x571);
	wdt_init(1);
	user_init();
	ets_timer_disarm(&check_timeouts_timer);
	ets_timer_arm_new(&check_timeouts_timer,lwip_timer_interval,1,1);
	uVar4 = g_ic.ic_profile.opmode;
	WDT->RST = 0x73;  /* WDT_FEED() */
	user_init_flag = 1;

